// 身份牌数据
export const identityCards = [
  {
    name: '长老',
    description: '购买道具时，抽二保留一'
  },
  {
    name: '女仆',
    description: '游戏开始时，获得一张道具牌'
  },
  {
    name: '守墓人',
    description: '当你翻到"女巫的毒药"时，免出局一次，随后将它盖回去和其他食物牌重新洗混'
  },
  {
    name: '小女孩',
    description: '你购买道具时只需花费4积分而不是5积分'
  },
  {
    name: '魔术师',
    description: '使用道具牌时，你可以查看桌上一张食物牌'
  },
  {
    name: '学者',
    description: '游戏开始时，获得5点积分，而不是3点'
  },
  {
    name: '少女',
    description: '你可以跳过你的回合(一局游戏一次)'
  },
  {
    name: '老流氓',
    description: '你可以获得一名其他玩家的3点积分(一局游戏一次)'
  },
  {
    name: '纯白之女',
    description: '可以将所有食物牌重新洗牌(一局游戏一次)'
  },
  {
    name: '弓箭手',
    description: '下一张食物牌的积分翻倍(一局游戏一次)'
  }
]

// 身份牌描述映射
export const identityDescriptions = {
  '长老': '购买道具时，抽二保留一',
  '女仆': '游戏开始时，获得一张道具牌',
  '守墓人': '当你翻到"女巫的毒药"时，免出局一次，随后将它盖回去和其他食物牌重新洗混',
  '小女孩': '你购买道具时只需花费4积分而不是5积分',
  '魔术师': '使用道具牌时，你可以查看桌上一张食物牌',
  '学者': '游戏开始时，获得5点积分，而不是3点',
  '少女': '你可以跳过你的回合(一局游戏一次)',
  '老流氓': '你可以获得一名其他玩家的3点积分(一局游戏一次)',
  '纯白之女': '可以将所有食物牌重新洗牌(一局游戏一次)',
  '弓箭手': '下一张食物牌的积分翻倍(一局游戏一次)'
}